DROP database IF EXISTS hotel_booking;

CREATE database hotel_booking;

use hotel_booking;

-- **users** - таблица пользователей системы.


-- **hotel_administrators** - таблица для владельцев и контент менеджеров отелей (мет размещения), отделено, так так у этих пользователей отличный функционал от пользователей таблицы users


-- **media_types** - таблица, описывающая типы медиафайлов. Предполагаются изображения, видеофайлы.


-- **media_files** - таблица для хранения медиафайлов и привязки их к объектам


-- **booking** - таблица заявок на бронирование


-- **reviews** - таблица отзывов о проживании
